; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph0 - mode
	thermograph1 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	Star3 - direction
	Star4 - direction
	Star7 - direction
	Star6 - direction
	GroundStation5 - direction
	GroundStation8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
	Star15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star6)
	(supports instrument1 spectrograph0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 spectrograph0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet18)
)
(:goal (and
	(pointing satellite0 Phenomenon10)
	(have_image Planet9 spectrograph0)
	(have_image Phenomenon10 thermograph1)
	(have_image Planet11 thermograph1)
	(have_image Phenomenon12 spectrograph0)
	(have_image Planet13 spectrograph0)
	(have_image Star14 spectrograph0)
	(have_image Star15 thermograph1)
	(have_image Star16 thermograph1)
	(have_image Phenomenon17 thermograph1)
	(have_image Planet18 spectrograph0)
))

)

; plan
1. (turn_to satellite0 star6 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 star6)
   goals met: 0 of 11
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 11
3. (calibrate satellite0 instrument0 star6)
   added: (calibrated instrument0)
   goals met: 0 of 11
4. (turn_to satellite0 planet11 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet11)
   goals met: 0 of 11
5. (take_image satellite0 planet11 instrument0 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 1 of 11
6. (turn_to satellite0 phenomenon17 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon17)
   goals met: 1 of 11
7. (take_image satellite0 phenomenon17 instrument0 thermograph1)
   added: (have_image phenomenon17 thermograph1)
   goals met: 2 of 11
8. (turn_to satellite0 phenomenon12 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 11
9. (take_image satellite0 phenomenon12 instrument0 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 3 of 11
10. (turn_to satellite0 planet13 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet13)
   goals met: 3 of 11
11. (take_image satellite0 planet13 instrument0 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 4 of 11
12. (turn_to satellite0 planet18 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet18)
   goals met: 4 of 11
13. (take_image satellite0 planet18 instrument0 spectrograph0)
   added: (have_image planet18 spectrograph0)
   goals met: 5 of 11
14. (turn_to satellite0 planet9 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 planet9)
   goals met: 5 of 11
15. (take_image satellite0 planet9 instrument0 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 6 of 11
16. (turn_to satellite0 star14 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star14)
   goals met: 6 of 11
17. (take_image satellite0 star14 instrument0 spectrograph0)
   added: (have_image star14 spectrograph0)
   goals met: 7 of 11
18. (turn_to satellite0 star15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star15)
   goals met: 7 of 11
19. (take_image satellite0 star15 instrument0 thermograph1)
   added: (have_image star15 thermograph1)
   goals met: 8 of 11
20. (turn_to satellite0 star16 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star16)
   goals met: 8 of 11
21. (take_image satellite0 star16 instrument0 thermograph1)
   added: (have_image star16 thermograph1)
   goals met: 9 of 11
22. (turn_to satellite0 phenomenon10 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 phenomenon10)
   goals met: 10 of 11
23. (take_image satellite0 phenomenon10 instrument0 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 11 of 11
